In [60]:
import pandas as pd
import numpy as np

In [61]:
left = pd.DataFrame({
    "id_l":[1,2,3,4,5],
    "Name_l":["Alex","Amy","Allen","Alice","Ayoung"],
    "subject_id":["sub1","sub2","sub4","sub6","sub5"]})

right=pd.DataFrame({
    "id_r":[1,2,3,4],
    "Name_r":["Billy","Brian","Bran","Bryce"],
    "subject_id":["sub2","sub4","sub3","sub6"]})

In [62]:
left.merge(right,how="left",on="subject_id")

   id_l  Name_l subject_id  id_r Name_r
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   NaN    NaN

In [63]:
left_df = pd.DataFrame({
    "subject_id":[1,2,3,4,5],
    "first_name":["Alex","Amy","Allen","Alice","Ayoung"],
    "last_name":["Anderson","Ackerman","Ali","Aoni","Atiches"]
})

right_df = pd.DataFrame({
    "subject_id":[4,5,6,7,8],
    "first_name":["Billy","Brian","Bran","Bryce","Betty"],
    "last_name":["Bonder","Black","Balwner","Brice","Btisan"]
})

In [64]:
left_df.merge(right_df,on="subject_id",how="right")

   subject_id first_name_x last_name_x first_name_y last_name_y
0           4        Alice        Aoni        Billy      Bonder
1           5       Ayoung     Atiches        Brian       Black
2           6          NaN         NaN         Bran     Balwner
3           7          NaN         NaN        Bryce       Brice
4           8          NaN         NaN        Betty      Btisan

In [65]:
left.merge(right,on="subject_id",how="outer")

   id_l  Name_l subject_id  id_r Name_r
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   NaN    NaN
5   NaN     NaN       sub3   3.0   Bran

In [66]:
employee_l=pd.DataFrame({
    "employee":["Bob","Jake","Lisa","Sue"],
    "group":["Accounting","Engeneering","Engeneering","HR"]
})
employee_r=pd.DataFrame({
    "name":["Bob","Jake","Lisa","Sue"],
    "salary":[70000,80000,120000,90000]
})

In [67]:
employee_l.merge(employee_r,left_on="employee",right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engeneering  Jake   80000
2     Lisa  Engeneering  Lisa  120000
3      Sue           HR   Sue   90000

In [68]:
employee_l.merge(employee_r,left_on="employee",right_on="name").drop("name",axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engeneering   80000
2     Lisa  Engeneering  120000
3      Sue           HR   90000

In [69]:
a2011=pd.read_csv("../data/americas_2011.csv",index_col=0)
a2012=pd.read_csv("../data/americas_2012.csv",index_col=0)

print(a2011)
print(a2012)

           2011
Country
Canada   1700.0
Chile    2047.4
Mexico   2250.2
USA      1786.0
           2012
Country
Canada   1713.0
Chile    2024.0
Mexico   2225.8
USA      1789.0

In [70]:
pd.merge(a2011,a2012,left_index=True,right_index=True)

           2011    2012
Country
Canada   1700.0  1713.0
Chile    2047.4  2024.0
Mexico   2250.2  2225.8
USA      1786.0  1789.0

In [71]:
a2011.join(a2012)

           2011    2012
Country
Canada   1700.0  1713.0
Chile    2047.4  2024.0
Mexico   2250.2  2225.8
USA      1786.0  1789.0

In [72]:
a2012_not_indexed= pd.read_csv("../data/americas_2012.csv")

In [73]:
pd.merge(a2011,a2012_not_indexed,left_index=True,right_on="Country")

     2011 Country    2012
0  1700.0  Canada  1713.0
1  2047.4   Chile  2024.0
2  2250.2  Mexico  2225.8
3  1786.0     USA  1789.0

In [74]:
left_df.merge(right_df,on="subject_id",how="right",suffixes=["_L","_R"])

   subject_id first_name_L last_name_L first_name_R last_name_R
0           4        Alice        Aoni        Billy      Bonder
1           5       Ayoung     Atiches        Brian       Black
2           6          NaN         NaN         Bran     Balwner
3           7          NaN         NaN        Bryce       Brice
4           8          NaN         NaN        Betty      Btisan

In [75]:
abbrevs = pd.read_excel("../data/state-abbrevs_my.xlsx")
areas = pd.read_excel("../data/state-areas_my.xlsx")
pop = pd.read_excel("../data/state-pop_my.xlsx")

In [76]:
abbrevs

                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY

In [77]:
pop

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
...           ...      ...   ...          ...
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

In [78]:
# 2
merged= pd.merge(abbrevs,pop,left_on="abbreviation",right_on="state/region",how="outer").drop("abbreviation",axis=1)
merged

        state state/region     ages  year   population
0     Alabama           AL  under18  2012    1117489.0
1     Alabama           AL    total  2012    4817528.0
2     Alabama           AL  under18  2010    1130966.0
3     Alabama           AL    total  2010    4785570.0
4     Alabama           AL  under18  2011    1125763.0
...       ...          ...      ...   ...          ...
2539      NaN          USA    total  2010  309326295.0
2540      NaN          USA  under18  2011   73902222.0
2541      NaN          USA    total  2011  311582564.0
2542      NaN          USA  under18  2012   73708179.0
2543      NaN          USA    total  2012  313873685.0

[2544 rows x 5 columns]

In [79]:
# 3
merged.isnull().any()

state            True
state/region    False
ages            False
year            False
population       True
dtype: bool

In [80]:
# 4
null_merged = merged[merged["state"].isnull()|merged["population"].isnull()]

In [81]:
null_merged.head()

     state state/region     ages  year  population
2448   NaN           PR  under18  1990         NaN
2449   NaN           PR    total  1990         NaN
2450   NaN           PR    total  1991         NaN
2451   NaN           PR  under18  1991         NaN
2452   NaN           PR    total  1993         NaN

In [82]:
null_merged.tail()

     state state/region     ages  year   population
2539   NaN          USA    total  2010  309326295.0
2540   NaN          USA  under18  2011   73902222.0
2541   NaN          USA    total  2011  311582564.0
2542   NaN          USA  under18  2012   73708179.0
2543   NaN          USA    total  2012  313873685.0

In [83]:
# 5
merged[merged["state"].isnull()].loc[:,"state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [102]:
USA_Mask = merged.loc[:,"state/region"]=="USA"
USA_Mask

0       False
1       False
2       False
3       False
4       False
        ...
2539     True
2540     True
2541     True
2542     True
2543     True
Name: state/region, Length: 2544, dtype: bool

In [101]:
PR_Mask = merged.loc[:,"state/region"]=="PR"
PR_Mask

0       False
1       False
2       False
3       False
4       False
        ...
2539    False
2540    False
2541    False
2542    False
2543    False
Name: state/region, Length: 2544, dtype: bool

In [100]:
merged.loc[:,"state"][PR_Mask]= "Puerto Rico"

C:\Users\luche\AppData\Local\Temp\ipykernel_10368\17767632.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  merged.loc[:,"state"][PR_Mask]= "Puerto Rico"

In [98]:
merged.loc[:,"state"][USA_Mask]= "United States of America"

C:\Users\luche\AppData\Local\Temp\ipykernel_10368\3580375279.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  merged.loc[:,"state"][USA_Mask]= "United States of America"

In [99]:
merged

                         state state/region     ages  year   population
0                      Alabama           AL  under18  2012    1117489.0
1                      Alabama           AL    total  2012    4817528.0
2                      Alabama           AL  under18  2010    1130966.0
3                      Alabama           AL    total  2010    4785570.0
4                      Alabama           AL  under18  2011    1125763.0
...                        ...          ...      ...   ...          ...
2539  United States of America          USA    total  2010  309326295.0
2540  United States of America          USA  under18  2011   73902222.0
2541  United States of America          USA    total  2011  311582564.0
2542  United States of America          USA  under18  2012   73708179.0
2543  United States of America          USA    total  2012  313873685.0

[2544 rows x 5 columns]

In [103]:
# 6
merged.isnull().any()

state           False
state/region    False
ages            False
year            False
population       True
dtype: bool

In [107]:
# 7
# areas
merged = pd.merge(merged,areas, on="state",how="outer")
merged

,state,state/region,ages,year,population,area (sq. mi)
0,Alabama,AL,under18,2012,1117489.0,52423.0
1,Alabama,AL,total,2012,4817528.0,52423.0
2,Alabama,AL,under18,2010,1130966.0,52423.0
3,Alabama,AL,total,2010,4785570.0,52423.0
4,Alabama,AL,under18,2011,1125763.0,52423.0
...,...,...,...,...,...,...
2539,United States of America,USA,total,2010,309326295.0,NaN
2540,United States of America,USA,under18,2011,73902222.0,NaN
2541,United States of America,USA,total,2011,311582564.0,NaN
2542,United States of America,USA,under18,2012,73708179.0,NaN
2543,United States of America,USA,total,2012,313873685.0,NaN

In [108]:
# 8
merged.isnull().any()

state            False
state/region     False
ages             False
year             False
population        True
area (sq. mi)     True
dtype: bool